/**
 * Created by lpf on 2017/10/14
 */

function searchFun() {
    var searchContent = $("#search").val();
    /* var ObjString={
         "weixin":[{"id":40,"title":"河长制工作机制连连看（上）","content":"❈ 日前，水利部办公厅印发了《关于加强全面推行河长制工作制度建设的通知》，督促各地建立完善河长制相关工作制度。 在实际工作中，一些地方积极探索有特色的工作制度，有力推进了河长制工作的有序开展。 本期，我们先来看看黄河流域和浙江省的有关制度。 ❈ 黄河流域（片） 省级河长办联席会议制度 联席会议主要任..."},{"id":42,"title":"3年，他写了上万字巡河日记","content":"“2017年2月13日，对上旦源河道进行了巡查，重点检查了河道河岸保洁、入河排污口情况。入河排污口已通过截污纳管整治到位，但河岸存在零星垃圾，六角亭边有成堆建筑垃圾。立即通知河道保洁员清理，联系村级河长去处理建筑垃圾，并要求保洁公司加快镇域内垃圾清理周转速度。” “2017年3月30日，对湖山源河道..."},{"id":132,"title":"我省专题培训全面推行河长制工作","content":"为深化对全面推行河长制工作重要性的认识，提升做好全面推行河长制工作的能力，加强交流沟通，开拓视野和思路，8月29日，省河长办在贵阳举办贵州省全面推行河长制工作专题培训班。省水利厅党组副书记、副厅长、省河长办副主任帅文讲话。 帅文在讲话中指出，全面推行河长制是中央部署的一项重大改革，是我国水治理体制和..."},{"id":58,"title":"杭州河道设置输送管 除淤泥清浊水","content":"4月5日，在杭州下城区石桥街道钱家河，清淤人员将淤泥用泥浆输运管抽到数千米外的淤泥沉淀场进行固化处理。泥浆输送管长期埋在河道中，像病人输液的“留置针”一样，当河道淤泥堆积到影响水质时，可通过临时提升泵，将淤泥输送到指定处理点进行泥、水分离。　　截至目前，杭州市下城区运河以北的27条河道埋设了淤泥输送..."},{"id":138,"title":"守护碧水青山　构筑生态长廊","content":"守护碧水青山　构筑生态长廊 赤水河流域仁怀段生态保护治理纪实 “神秘的赤水河,悄悄在流淌,风情万种一路芬芳；神奇的赤水河,远远流淌,波涛万里酿美酒,醉了四方……”一条河奔流不息、一首歌传唱不朽。 赤水河，“集灵泉于一身，汇秀水而东下。”因盛产国酒茅台飘香五洲，因红军“四渡赤水”名扬天下，故名生态河、..."},{"id":110,"title":"湖南“总河长”：治河要抓好这六味良药 ~","content":"9月22日，湖南市州河长办工作会议传达2017年全省第一次河长会议精神，湖南省总河长，省委副书记、省长许达哲向全省开出治河良方，六味良药直指症结。 第一味药：抓好水污染防治 饮用水水源保护方面 ： 要加快取缔90个饮用水水源一级、二级保护区内的排污口，确保年底前全面关闭或拆除非法入河排污口。水源地保..."},{"id":106,"title":"国务院办公厅关于印发第二次全国污染源普查...","content":"这是环境修复论坛推送的第 384 篇文章。谢谢（欢迎）转发分享。 导语： 普查对象为中华人民共和国境内有污染源的单位和个体经营户。 来源： 中华人民共和国中央人民政府 各省、自治区、直辖市人民政府，国务院各部委、各直属机构： 《第二次全国污染源普查方案》已经国务院同意，现印发给你们，请认真组织实施。..."},{"id":107,"title":"纪实：地质调查成果支撑服务长江经济带保护...","content":"这是环境修复论坛推送的第 387 篇文章。谢谢（欢迎）转发分享。 导语： 4.5亿亩无重金属污染耕地集中分布在长江经济带上 来源： 中国矿业报，记者-潘冰 ， 特约撰稿-林良俊；原标题《地调支撑长江经济带发展》 摘要：长江经济带横跨我国东中西三大区域，具有独特优势和巨大发展潜力，已成为我国综合实力最..."},{"id":33,"title":"北京河长制建立“一图、一书、一表”管理机...","content":"7月28日，北京市人民政府新闻办公室召开北京市河长制新闻发布会。北京市水务局、北京市海淀区人民政府、北京市环保局等单位相关负责人介绍情况并回答记者提问。 发布会上，北京市水务局副局长张世清介绍《北京市进一步全面推进河长制工作方案》。 7月6日，北京市委全面深化改革领导小组审议通过了《北京市进一步全面..."},{"id":24,"title":"环境保护部迅速落实党中央、国务院领导同志...","content":"点击上方“中国环境新闻”可加关注哦 8月8日四川省阿坝州九寨沟县地震和8月9日新疆博尔塔拉州精河县地震发生后，环境保护部迅速行动，积极做好次生突发环境事件防范应对工作。 环境保护部部长李干杰先后两次召开专题会，学习传达习近平总书记、李克强总理等领导同志重要批示精神，要求指导、支持和督促地方密切关注和..."}],
         "paper":[{"id":3483,"title":"金华市农村生活污水治理长效运维管理的调查...","content":"农村生活污水治理是涉及千家万户的民心工程，也是承载“两美”金华建设的基础工程，浙江省金华市把它作为打造美丽乡村升级版的重要抓手强势推进。本文通过对金华市农村生活污水治理设施长效运维管理情况的调查分析，就加快推进转型升级工作提出对策建议。"},{"id":822,"title":"关于开展农村生活污水治理工作的思考","content":"浙江省绍兴市越城区农村生活污水治理起步于2008年5月,2013年浙江省委、省政府部署\"五水共治、治污先行\"后,该区将农村生活污水治理作为\"五水共治\"的重点任务之一,全面规划、分步实施,突出工程项目建设,一手抓进度,一手抓质量,确保了农村生活污水治理工作有序推进."},{"id":999,"title":"厌氧滤池＋人工湿地污水处理工艺在农村污水...","content":"1工程概况郑家村位于浙江省四明山区,地处宁波市鄞州区樟溪与龙观乡交界,郑家为其中的一个自然村,常住人口约1226人,558户。为了贯彻浙江省811行动计划和环境污染治理行动方案,推进城乡一体化,实现可持续发展,切实解决农村水污染问题,我公司拟对该村的生活污水进行集中生态处理。"},{"id":2412,"title":"宁波市农村生活污水治理实施评估","content":"调研宁波市农村生活污水治理现状情况，并对治理中的应用技术、环境目标等进行分析。针对现状宁波市农村生活污水治理中存在的一些问题，提出对策建议。"},{"id":3590,"title":"农村污水治理设施建设现状及问题和建议","content":"随着人们生活质量不断的提高，农村生活污水环境污染不容忽视，治理不当将使耕地灌溉得不到有效保障，危害农民的生存发展，由其是加剧淡水资源的危机。本文通过分析浙江省温州市文成县农村污水治理现状，存在的问题和建议，引用有关部门及院所对农村污水治理设施建设的研究，探讨在建农村污水治理试点工程的投资效益，同时对..."},{"id":1787,"title":"《嘉兴市污水治理专业规划》回顾与总结","content":"《嘉兴市污水治理专业规划》是《嘉兴市城市总体规划》(2020年)的延续和推进,是新一轮嘉兴市城市发展和环境保护的需要,是嘉兴市域范围内污水处理工程建设重要的指导性文件.通过对《嘉兴市污水治理专业规划》的回顾与总结,对进一步贯彻国家“节能减排”的基本国策、优化市域空间和产业结构的总体布局、研究污水专项..."},{"id":3998,"title":"黄岩区农村生活污水治理的实践与思考","content":"2013年以来，浙江省台州市黄岩区按照省委、省政府“五水共治、治污先行”的决策部署，凝心聚力，攻坚破难，结合村庄整治和美丽乡村建设，实行“四个三”模式，全面打响农村生活污水治理攻坚战，计划用3年时间，投资12亿多资金，努力重现黄岩绿水青山美景。"},{"id":2808,"title":"杭州市农村生活污水治理现状及对策","content":"杭州市农村基础设施建设相对滞后，随着农村经济和乡村休闲旅游业的发展，生活污水对环境的影响愈来愈大，成为制约农村环境改善的重要因素。系统分析了目前杭州市农村生活污水治理现状及存在的问题，并提出解决对策，以期对加强杭州市农村环境保护和建设“美丽杭州”起到积极的推动作用。"},{"id":4350,"title":"绍兴市河长制管理工作的探索与实践","content":"绍兴市是一座拥有2 500年历史的古城,也是典型的江南水乡,水网密布,河湖众多.全市共有河道6 759条,总长10 887 km,总水域面积400多km2,占全市总面积的5.6％.其中中心城市规划区水域面积占14.7％,位列浙江省第一.2012年10月,绍兴市政府出台了《关于在绍兴市区主要河道实施“..."},{"id":3993,"title":"农村生活污水治理政策体系探讨——以浙江省...","content":"围绕浙江省农村生活污水处理中存在的主要问题,并结合浙江省农村生活污水治理政策现状,深入地剖析了浙江省在农村生活污水治理推进过程中政策的不足,进而构建了农村生活污水治理政策体系基本框架,以法律、规划、考核、投入、运维及技术为政策主题,有针对性地提出了具体政策措施,为深入开展农村生活污水治理提供政策导向..."}]
     }*/
    var html1 = '<tr class="titleTr1"><td class="titleTd"><a href="#" class="titleA1" onclick="showFun(this.id)"></a></td></tr>'
        + '<tr class="titleTr1"><td class="content1"></td></tr>';
    var html2 = '<tr class="titleTr2"><td class="titleTd"><a href="#" class="titleA2" onclick="showFun(this.id)"></a></td></tr>'
        + '<tr class="titleTr2"><td class="content2"></td></tr>';
    $.ajax({
        type: "post",
        url: "dosearch",
        data: {
            searchContent: searchContent
        },
        dataType: "json",
        success: function (state) {
            $(".showBody").empty();
            var ObjString = eval('(' + state.result + ')');
            var weixinlen = ObjString.weixin.length;
            var paperlen = ObjString.paper.length;
            for (var i = 0; i < weixinlen; i++) {
                $(".showBody").append(html1);
                $(".titleA1").eq(i).attr("id", ObjString.weixin[i].id);
                $(".titleA1").eq(i).html(ObjString.weixin[i].title);
                $(".content1").eq(i).text(ObjString.weixin[i].content);
                $(".titleTr1").attr("class", "weixin");
            }
            for (var j = 0; j < paperlen; j++) {
                $(".showBody").append(html2);
                $(".titleA2").eq(j).attr("id", ObjString.paper[j].id);
                $(".titleA2").eq(j).html(ObjString.paper[j].title);
                $(".content2").eq(j).text(ObjString.paper[j].content);
                $(".titleTr2").attr("class", "paper");
            }
            $(".paper").css("display", "none");
        }
    });
}

function typeFun(id) {
    if (id == "weixin") {
        $(".paper").css("display", "none");
        $(".weixin").css("display", "block")
    } else if (id == "paper") {
        $(".weixin").css("display", "none");
        $(".paper").css("display", "block")
    }
}

var sth;
var clickType;
function showFun(id) {
    var type = $("#" + id).parent().parent().attr('class');
    clickType=type;
    // alert(id);
    $.ajax({
        type: "post",
        url: "detail",
        data: {
            id: id,
            type: type
        },
        dataType: "json",
        success: function (state) {
            sth = state;
            console.log(state);
            if(clickType=="weixin"){
                $(".articleTitle").html(state.public_name);
                $(".articleContent").html(state.main_body);

                $("#kindBox").css("display", "none");
                $("#showBox").css("display", "none");
                $(".article").css("display", "block");
            }else if(clickType == "paper"){
                $(".lunwenTitle").html(state.title);
                $(".lunwenAuthor").html(state.author);
                $(".lunwenAbstract").html(state.abstract);
                $(".lunwenUnit").html(state.unit);
                $(".lunwenA").attr("href",state.file_url);
                $(".lunwenFilePath").attr("href","http://10.1.17.25:8080/"+state.file_path.substr(5));
                $("#kindBox").css("display", "none");
                $("#showBox").css("display", "none");
                $(".lunwenPaper").css("display","block")
            }



        }
    });
}

function returnPage() {
    $("#kindBox").css("display", "block");
    $("#showBox").css("display", "block");
    $(".article").css("display", "none")
}